Revit 2026 API

# IFCExtrusionData Properties

---

The IFCExtrusionData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ExtrusionBasis | The basis used for the extrusion. |
|  | ExtrusionDirection | The direction used for the extrusion. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | ScaledExtrusionLength | The length of the extrusion, scaled in the units of the export. |

#### Reference

IFCExtrusionData Class

Autodesk.Revit.DB.IFC Namespace